In [1]:
import numpy as np
import pandas as pd

s = pd.Series([1,2,3,45,5])
s

0     1
1     2
2     3
3    45
4     5
dtype: int64

In [3]:
dates = pd.date_range('20190113',periods=10)
dates

DatetimeIndex(['2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22'],
              dtype='datetime64[ns]', freq='D')

In [9]:
a = pd.DataFrame(np.random.rand(10,4),index = dates, columns=list('ABCD'))
a

                   A         B         C         D
2019-01-13  0.034130  0.385678  0.129301  0.746347
2019-01-14  0.554049  0.842003  0.721697  0.807314
2019-01-15  0.627718  0.052141  0.925270  0.215185
2019-01-16  0.204675  0.358175  0.110304  0.690956
2019-01-17  0.775465  0.391624  0.380283  0.532341
2019-01-18  0.006407  0.013683  0.127045  0.180903
2019-01-19  0.642353  0.319279  0.381312  0.375798
2019-01-20  0.405740  0.540638  0.074406  0.478069
2019-01-21  0.824031  0.568913  0.012442  0.963807
2019-01-22  0.416757  0.263081  0.465780  0.107281

In [10]:
print(list('abcde'))

['a', 'b', 'c', 'd', 'e']

In [13]:
for i in "amit":
    print (i)

a
m
i
t

In [14]:
d = {'a': 0., 'b': 1., 'c': 2.}
df1 = pd.Series(d)
df2 = pd.Series(d, index=['b', 'c', 'd', 'a'])
df2

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [15]:
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [18]:
s[:3]

0    1
1    2
2    3
dtype: int64

In [17]:
s

0     1
1     2
2     3
3    45
4     5
dtype: int64

In [19]:
s[s>s.mean()]

3    45
dtype: int64

In [20]:
s1 = pd.Series([1,2,3], index = (list("abc")))
s1

a    1
b    2
c    3
dtype: int64

In [21]:
s2 = pd.Series([4,5,6], index = list("xyz"))
s2

x    4
y    5
z    6
dtype: int64

In [22]:
s1+s2

a   NaN
b   NaN
c   NaN
x   NaN
y   NaN
z   NaN
dtype: float64

# DataFrame

In [43]:
d = {"a":pd.Series([1,2,3,4], index = ["a","b","c","d"]),
     "b":pd.Series([5,6,7,8], index = ["a","b","c","d"])}

df = pd.DataFrame(d)
df

   a  b
a  1  5
b  2  6
c  3  7
d  4  8

In [26]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   a  b
d  4  8
b  2  6
a  1  5

In [27]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['b', 'c'])

   b    c
d  8  NaN
b  6  NaN
a  5  NaN

In [28]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [29]:
df.columns

Index(['a', 'b'], dtype='object')

In [31]:
#From structured or record array
data = np.zeros((2, ), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'a10')])
data[:] = [(1, 2., 'Hello'), (2, 3., "World")]
data

array([(1, 2., b'Hello'), (2, 3., b'World')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [32]:
pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [33]:
# From a list of dicts

data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data2)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [35]:
amit = "TRUE"
print(type(amit))

<class 'str'>

In [36]:
#From a list of dicts
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [37]:
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [38]:
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

In [39]:
#From a dict of tuples
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
                  ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
                  ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
                  ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
                  ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

### Alternate Constructors
DataFrame.from_dict

In [40]:
pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [41]:
dict([("a",[1,2,3]),("b",[4,5,6])])

{'a': [1, 2, 3], 'b': [4, 5, 6]}

# Column selection, addition, deletion

In [44]:
df

   a  b
a  1  5
b  2  6
c  3  7
d  4  8

In [46]:
df.columns = ["one","two"]
df

   one  two
a    1    5
b    2    6
c    3    7
d    4    8

In [47]:
df["one"]

a    1
b    2
c    3
d    4
Name: one, dtype: int64

In [48]:
df['three'] = df['one'] * df['two']
df

   one  two  three
a    1    5      5
b    2    6     12
c    3    7     21
d    4    8     32

In [49]:
df['flag'] = df['one'] > 2
df

   one  two  three   flag
a    1    5      5  False
b    2    6     12  False
c    3    7     21   True
d    4    8     32   True

In [50]:
#to delete a column
del df['two']
df

   one  three   flag
a    1      5  False
b    2     12  False
c    3     21   True
d    4     32   True

In [51]:
three = df.pop('three')
df

   one   flag
a    1  False
b    2  False
c    3   True
d    4   True

In [52]:
#When inserting a scalar value, it will naturally be propagated to fill the column:
df['foo'] = 'bar'
df

   one   flag  foo
a    1  False  bar
b    2  False  bar
c    3   True  bar
d    4   True  bar

In [53]:
#When inserting a Series that does not have the same index as the DataFrame, 
#it will be conformed to the DataFrame’s index
df['one_trunc'] = df['one'][:2]
df

   one   flag  foo  one_trunc
a    1  False  bar        1.0
b    2  False  bar        2.0
c    3   True  bar        NaN
d    4   True  bar        NaN

In [54]:
# You can insert raw ndarrays but their length must match the length of the DataFrame’s index.
# By default, columns get inserted at the end. 
# The insert function is available to insert at a particular location in the columns:

df.insert(1, 'bar', df['one'])
df

   one  bar   flag  foo  one_trunc
a    1    1  False  bar        1.0
b    2    2  False  bar        2.0
c    3    3   True  bar        NaN
d    4    4   True  bar        NaN

# Assigning New Columns in Method Chains

In [60]:

# DataFrame has an assign() method that allows you to easily create new columns 
# that are potentially derived from existing columns.
# assign always returns a copy of the data, leaving the original DataFrame untouched.


df.assign(ratio = df["one"]/df["bar"]).head()
df.assign(ratio = lambda x : df["one"]/df["bar"]).head()

   one  bar   flag  foo  one_trunc  ratio
a    1    1  False  bar        1.0    1.0
b    2    2  False  bar        2.0    1.0
c    3    3   True  bar        NaN    1.0
d    4    4   True  bar        NaN    1.0

In [6]:
dfa = pd.DataFrame({"a":[1,2,3],"b":[4,5,6]})
dfa

   a  b
0  1  4
1  2  5
2  3  6

In [9]:
dfa = dfa.assign(c = lambda x: x["a"] * x["b"],
              d = lambda x: x["a"] * x["c"])
dfa

   a  b   c   d
0  1  4   4   4
1  2  5  10  20
2  3  6  18  54

### Indexing / Selection¶

In [10]:
# The basics of indexing are as follows:

# Operation	Syntax	Result
# Select column	df[col]	Series
# Select row by label	df.loc[label]	Series
# Select row by integer location	df.iloc[loc]	Series
# Slice rows	df[5:10]	DataFrame
# Select rows by boolean vector	df[bool_vec]	DataFrame

NameError: name 'df' is not defined

In [21]:
df1 = pd.DataFrame({"a":[1,0,1], "b":[0,1,1]},dtype = bool)
df1

       a      b
0   True  False
1  False   True
2   True   True

In [14]:
df2 = pd.DataFrame({"a":[0,1,1],"b":[1,1,0]}, dtype=bool)
df2

       a      b
0  False   True
1   True   True
2   True  False

In [15]:
df1*df2

/Users/amit.panda03/anaconda3/lib/python3.7/site-packages/pandas/core/computation/expressions.py:180: UserWarning: evaluating in Python space because the '*' operator is not supported by numexpr for the bool dtype, use '&' instead
  .format(op=op_str, alt_op=unsupported[op_str]))

       a      b
0  False  False
1  False   True
2   True  False

In [16]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [33]:
np.asarray(df1)

array([[ True, False],
       [False,  True],
       [ True,  True]])

In [18]:
df3 = pd.DataFrame(np.asarray(df1))
df3

       0      1
0   True  False
1  False   True
2   True   True

In [19]:
df.0

SyntaxError: invalid syntax (<ipython-input-19-74b769b7016d>, line 1)

In [20]:
df1.0

SyntaxError: invalid syntax (<ipython-input-20-46c7f28e78d6>, line 1)

In [22]:
df1.a

0     True
1    False
2     True
Name: a, dtype: bool

In [24]:
df1

       a      b
0   True  False
1  False   True
2   True   True

In [27]:
df1.columns = [x.upper() for x in df1.columns]
df1

       A      B
0   True  False
1  False   True
2   True   True

In [28]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

a   -1.292845
b   -0.536123
c   -0.158525
d    0.245791
e   -0.049735
dtype: float64

In [34]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a -0.406268 -0.011414       NaN
b  1.494257 -0.350783  3.394692
c  1.269588 -0.541104  0.850053
d       NaN -0.115603  0.035507

In [35]:
row = df.iloc[2]
row

one      1.269588
two     -0.541104
three    0.850053
Name: c, dtype: float64

In [37]:
column = df["two"]
column

a   -0.011414
b   -0.350783
c   -0.541104
d   -0.115603
Name: two, dtype: float64

In [38]:
df.sub(row,axis = "columns")

        one      two     three
a -1.675857  0.52969       NaN
b  0.224669  0.19032  2.544639
c  0.000000  0.00000  0.000000
d       NaN  0.42550 -0.814546

In [39]:
df.sub(row, axis=1)

        one      two     three
a -1.675857  0.52969       NaN
b  0.224669  0.19032  2.544639
c  0.000000  0.00000  0.000000
d       NaN  0.42550 -0.814546

In [40]:
df.sub(column, axis='index')

        one  two     three
a -0.394854  0.0       NaN
b  1.845040  0.0  3.745475
c  1.810692  0.0  1.391157
d       NaN  0.0  0.151110

In [41]:
df.sub(column, axis=0)

        one  two     three
a -0.394854  0.0       NaN
b  1.845040  0.0  3.745475
c  1.810692  0.0  1.391157
d       NaN  0.0  0.151110

In [42]:
s = pd.Series(np.arange(10))
div, rem = divmod(s, 3)
div

0    0
1    0
2    0
3    1
4    1
5    1
6    2
7    2
8    2
9    3
dtype: int64

In [43]:
df

        one       two     three
a -0.406268 -0.011414       NaN
b  1.494257 -0.350783  3.394692
c  1.269588 -0.541104  0.850053
d       NaN -0.115603  0.035507

In [45]:
(df>0).all()

one      False
two      False
three    False
dtype: bool

In [46]:
(df > 0).any()

one       True
two      False
three     True
dtype: bool

In [2]:
import pandas as pd
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9},
       'Ohio' : {2000: 1.5, 2001 : 1.7, 2002 : 3.6}}      
pop      

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6